## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
google_service_account.analyst_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_custom_role.uploader: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/uploaderRole]
google_project_iam_custom_role.analyst: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/analystRole]
google_pubsub_topic.topic: Refreshing state... [id=projects/tenacious-moon-447908-u4/topics/data-processed-topic]
google_project_iam_custom_role.processor: Refreshing state... [id=projects/tenacious-moon-447908-u4/roles/processorRole]
google_service_account.uploader_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_storage_bucket.data_bucket: Refreshing state... [id=tenacious-moon-447908-u4-data-bucket]
google_service_account.function_sa: Refreshing state... [id=projects/tenacious-moon-447908-u4/serviceAccounts/function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/tenacious-moon-447908-u4/datasets/serverless_processing_dataset]
google_project_iam_member.analyst_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/analystRole/serviceAccount:analyst-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_member.processor_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/processorRole/serviceAccount:function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_project_iam_member.uploader_bind: Refreshing state... [id=tenacious-moon-447908-u4/projects/tenacious-moon-447908-u4/roles/uploaderRole/serviceAccount:uploader-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com]
google_bigquery_table.table: Refreshing state... [id=projects/tenacious-moon-447908-u4/datasets/serverless_processing_dataset/tables/processed_data]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudfunctions2_function.function will be created
  + resource "google_cloudfunctions2_function" "function" {
      + description      = "Triggered by GCS upload, validates and loads data into BigQuery"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + environment      = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = "process-uploaded-file"
      + project          = "tenacious-moon-447908-u4"
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "process_file"
          + environment_variables = (known after apply)
          + runtime               = "python311"
          + service_account       = (known after apply)

          + automatic_update_policy (known after apply)

          + source {
              + storage_source {
                  + bucket     = "tenacious-moon-447908-u4-function-code"
                  + generation = (known after apply)
                  + object     = "function-source.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "us-central1"

          + event_filters {
              + attribute = "bucket"
              + value     = "tenacious-moon-447908-u4-data-bucket"
                # (1 unchanged attribute hidden)
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = (known after apply)
          + environment_variables            = (known after apply)
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 3
          + max_instance_request_concurrency = (known after apply)
          + service                          = (known after apply)
          + service_account_email            = "function-processor-sa@tenacious-moon-447908-u4.iam.gserviceaccount.com"
          + timeout_seconds                  = (known after apply)
          + uri                              = (known after apply)
        }
    }

  # google_storage_bucket.function_bucket will be created
  + resource "google_storage_bucket" "function_bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "tenacious-moon-447908-u4-function-code"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_object.function_zip will be created
  + resource "google_storage_bucket_object" "function_zip" {
      + bucket         = "tenacious-moon-447908-u4-function-code"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = "function-source.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "./../cloud-function/function-source.zip"
      + storage_class  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>